# ClearCavities

## Description
Procedure ClearCavities resets the default cavity style of wall objects to no cavities.

```pascal
PROCEDURE ClearCavities;
```

```python
def vs.ClearCavities():
    return None
```

## Examples
CreateWallObject2

```pascal
ClearCavities;
```
```python
import vs

# Procedure ClearCavities resets the default cavity style of wall objects to
# no cavities.
vs.ClearCavities()
```

## Version
ClearCavities is obsolete as of VectorWorks12.5<P>

Availability: from MiniCAD4.0

## Category
* Objects - Walls